stevenj/avr-libc3/include/avr/io/attiny261.h
/* Timer/Counter0 Output Compare Flag 0B */
typedef enum TC0_OCF0B_enum
{
    TC0_OCF0B_CLEAR_gc = (0x00), /* Timer/Counter0 Output Compare Flag 0B - CLEAR */
    TC0_OCF0B_SET_gc   = (0x08), /* Timer/Counter0 Output Compare Flag 0B - SET */
} TC0_OCF0B_t;

/* Timer/Counter0 Overflow Flag */
typedef enum TC0_TOV0_enum
{
    TC0_TOV0_CLEAR_gc = (0x00), /* Timer/Counter0 Overflow Flag - CLEAR */
    TC0_TOV0_SET_gc   = (0x02), /* Timer/Counter0 Overflow Flag - SET */
} TC0_TOV0_t;

/* Timer/Counter0 Input Capture Flag */
typedef enum TC0_ICF0_enum
{
    TC0_ICF0_CLEAR_gc = (0x00), /* Timer/Counter0 Input Capture Flag - CLEAR */
    TC0_ICF0_SET_gc   = (0x01), /* Timer/Counter0 Input Capture Flag - SET */
} TC0_ICF0_t;

/* Timer/Counter 0 Width */
typedef enum TC0_TCW0_enum
{
    TC0_TCW0_CLEAR_gc = (0x00), /* Timer/Counter 0 Width - CLEAR */
    TC0_TCW0_SET_gc   = (0x80), /* Timer/Counter 0 Width - SET */
} TC0_TCW0_t;

/* Input Capture Mode Enable */
typedef enum TC0_ICEN0_enum
{
    TC0_ICEN0_CLEAR_gc = (0x00), /* Input Capture Mode Enable - CLEAR */
    TC0_ICEN0_SET_gc   = (0x40), /* Input Capture Mode Enable - SET */
} TC0_ICEN0_t;

/* Input Capture Noice Canceler */
typedef enum TC0_ICNC0_enum
{
    TC0_ICNC0_CLEAR_gc = (0x00), /* Input Capture Noice Canceler - CLEAR */
    TC0_ICNC0_SET_gc   = (0x20), /* Input Capture Noice Canceler - SET */
} TC0_ICNC0_t;

/* Input Capture Edge Select */
typedef enum TC0_ICES0_enum
{
    TC0_ICES0_CLEAR_gc = (0x00), /* Input Capture Edge Select - CLEAR */
    TC0_ICES0_SET_gc   = (0x10), /* Input Capture Edge Select - SET */
} TC0_ICES0_t;

/* Analog Comparator Input Capture Enable */
typedef enum TC0_ACIC0_enum
{
    TC0_ACIC0_CLEAR_gc = (0x00), /* Analog Comparator Input Capture Enable - CLEAR */
    TC0_ACIC0_SET_gc   = (0x08), /* Analog Comparator Input Capture Enable - SET */
} TC0_ACIC0_t;

/* Waveform Generation Mode */
typedef enum TC0_WGM00_enum
{
    TC0_WGM00_CLEAR_gc = (0x00), /* Waveform Generation Mode - CLEAR */
    TC0_WGM00_SET_gc   = (0x01), /* Waveform Generation Mode - SET */
} TC0_WGM00_t;

/* Timer/Counter Synchronization Mode */
typedef enum TC0_TSM_enum
{
    TC0_TSM_CLEAR_gc = (0x00), /* Timer/Counter Synchronization Mode - CLEAR */
    TC0_TSM_SET_gc   = (0x10), /* Timer/Counter Synchronization Mode - SET */
} TC0_TSM_t;

/* Timer/Counter 0 Prescaler Reset */
typedef enum TC0_PSR0_enum
{
    TC0_PSR0_CLEAR_gc = (0x00), /* Timer/Counter 0 Prescaler Reset - CLEAR */
    TC0_PSR0_SET_gc   = (0x08), /* Timer/Counter 0 Prescaler Reset - SET */
} TC0_PSR0_t;

/* Clock Select */
typedef enum TC0_CS0_enum
{
    TC0_CS0_VAL_0x00_gc = (0x00), /* No Clock Source (Stopped) */
    TC0_CS0_VAL_0x01_gc = (0x01), /* Running, No Prescaling */
    TC0_CS0_VAL_0x02_gc = (0x02), /* Running, CLK/8 */
    TC0_CS0_VAL_0x03_gc = (0x03), /* Running, CLK/64 */
    TC0_CS0_VAL_0x04_gc = (0x04), /* Running, CLK/256 */
    TC0_CS0_VAL_0x05_gc = (0x05), /* Running, CLK/1024 */
    TC0_CS0_VAL_0x06_gc = (0x06), /* Running, ExtClk Tx Falling Edge */
    TC0_CS0_VAL_0x07_gc = (0x07), /* Running, ExtClk Tx Rising Edge */
} TC0_CS0_t;

/* Compare Output Mode, Bits */
#define TC1_TCCR1A_COM1A_gc(x) ((x<<6) & 0xC0)

/* Compare Output Mode, Bits */
#define TC1_TCCR1A_COM1B_gc(x) ((x<<4) & 0x30)

/* Force Output Compare Match 1A */
typedef enum TC1_FOC1A_enum
{
    TC1_FOC1A_CLEAR_gc = (0x00), /* Force Output Compare Match 1A - CLEAR */
    TC1_FOC1A_SET_gc   = (0x08), /* Force Output Compare Match 1A - SET */
} TC1_FOC1A_t;

/* Force Output Compare Match 1B */
typedef enum TC1_FOC1B_enum
{
    TC1_FOC1B_CLEAR_gc = (0x00), /* Force Output Compare Match 1B - CLEAR */
    TC1_FOC1B_SET_gc   = (0x04), /* Force Output Compare Match 1B - SET */
} TC1_FOC1B_t;

/* Pulse Width Modulator Enable */
typedef enum TC1_PWM1A_enum
{
    TC1_PWM1A_CLEAR_gc = (0x00), /* Pulse Width Modulator Enable - CLEAR */
    TC1_PWM1A_SET_gc   = (0x02), /* Pulse Width Modulator Enable - SET */
} TC1_PWM1A_t;

/* Pulse Width Modulator Enable */
typedef enum TC1_PWM1B_enum
{
    TC1_PWM1B_CLEAR_gc = (0x00), /* Pulse Width Modulator Enable - CLEAR */
    TC1_PWM1B_SET_gc   = (0x01), /* Pulse Width Modulator Enable - SET */
} TC1_PWM1B_t;

/* Timer/Counter 1 Prescaler reset */
typedef enum TC1_PSR1_enum
{
    TC1_PSR1_CLEAR_gc = (0x00), /* Timer/Counter 1 Prescaler reset - CLEAR */
    TC1_PSR1_SET_gc   = (0x40), /* Timer/Counter 1 Prescaler reset - SET */
} TC1_PSR1_t;

/* Dead Time Prescaler */
typedef enum TC1_DTPS1_enum
{
    TC1_DTPS1_VAL_0x00_gc = (0x00<<4), /* 1x */
    TC1_DTPS1_VAL_0x01_gc = (0x01<<4), /* 2x */
    TC1_DTPS1_VAL_0x02_gc = (0x02<<4), /* 4x */
    TC1_DTPS1_VAL_0x03_gc = (0x03<<4), /* 8x */
} TC1_DTPS1_t;

/* Clock Select Bits */
typedef enum TC1_CS1_enum
{
    TC1_CS1_VAL_0x00_gc = (0x00), /* No Clock Source (Stopped) */
    TC1_CS1_VAL_0x01_gc = (0x01), /* Running, No Prescaling */
    TC1_CS1_VAL_0x02_gc = (0x02), /* Running, CLK/2 */
    TC1_CS1_VAL_0x03_gc = (0x03), /* Running, CLK/4 */
    TC1_CS1_VAL_0x04_gc = (0x04), /* Running, CLK/8 */
    TC1_CS1_VAL_0x05_gc = (0x05), /* Running, CLK/16 */
    TC1_CS1_VAL_0x06_gc = (0x06), /* Running, CLK/32 */
    TC1_CS1_VAL_0x07_gc = (0x07), /* Running, CLK/64 */
    TC1_CS1_VAL_0x08_gc = (0x08), /* Running, CLK/128 */
    TC1_CS1_VAL_0x09_gc = (0x09), /* Running, CLK/256 */
    TC1_CS1_VAL_0x0A_gc = (0x0A), /* Running, CLK/512 */
    TC1_CS1_VAL_0x0B_gc = (0x0B), /* Running, CLK/1024 */
    TC1_CS1_VAL_0x0C_gc = (0x0C), /* Running, CLK/2048 */
    TC1_CS1_VAL_0x0D_gc = (0x0D), /* Running, CLK/4096 */
    TC1_CS1_VAL_0x0E_gc = (0x0E), /* Running, CLK/8192 */
    TC1_CS1_VAL_0x0F_gc = (0x0F), /* Running, CLK/16384 */
} TC1_CS1_t;

/* COM1A1 Shadow Bit */
typedef enum TC1_COM1A1S_enum
{
    TC1_COM1A1S_CLEAR_gc = (0x00), /* COM1A1 Shadow Bit - CLEAR */
    TC1_COM1A1S_SET_gc   = (0x80), /* COM1A1 Shadow Bit - SET */
} TC1_COM1A1S_t;

/* COM1A0 Shadow Bit */
typedef enum TC1_COM1A0S_enum
{
    TC1_COM1A0S_CLEAR_gc = (0x00), /* COM1A0 Shadow Bit - CLEAR */
    TC1_COM1A0S_SET_gc   = (0x40), /* COM1A0 Shadow Bit - SET */
} TC1_COM1A0S_t;

