stevenj/avr-libc3/include/avr/io/attiny261.h
/* COM1B1 Shadow Bit */
#define TC1_COM1B1S_CLEAR_gc (0x00) /* COM1B1 Shadow Bit - CLEAR */
#define TC1_COM1B1S_SET_gc   (0x20) /* COM1B1 Shadow Bit - SET */


/* COM1B0 Shadow Bit */
#define TC1_COM1B0S_CLEAR_gc (0x00) /* COM1B0 Shadow Bit - CLEAR */
#define TC1_COM1B0S_SET_gc   (0x10) /* COM1B0 Shadow Bit - SET */


/* Comparator D output mode */
#define TC1_TCCR1C_COM1D_gc(x) ((x<<2) & 0x0C)

/* Force Output Compare Match 1D */
#define TC1_FOC1D_CLEAR_gc (0x00) /* Force Output Compare Match 1D - CLEAR */
#define TC1_FOC1D_SET_gc   (0x02) /* Force Output Compare Match 1D - SET */


/* Pulse Width Modulator D Enable */
#define TC1_PWM1D_CLEAR_gc (0x00) /* Pulse Width Modulator D Enable - CLEAR */
#define TC1_PWM1D_SET_gc   (0x01) /* Pulse Width Modulator D Enable - SET */


/* Fault Protection Interrupt Enable */
#define TC1_FPIE1_CLEAR_gc (0x00) /* Fault Protection Interrupt Enable - CLEAR */
#define TC1_FPIE1_SET_gc   (0x80) /* Fault Protection Interrupt Enable - SET */


/* Fault Protection Mode Enable */
#define TC1_FPEN1_CLEAR_gc (0x00) /* Fault Protection Mode Enable - CLEAR */
#define TC1_FPEN1_SET_gc   (0x40) /* Fault Protection Mode Enable - SET */


/* Fault Protection Noise Canceler */
#define TC1_FPNC1_CLEAR_gc (0x00) /* Fault Protection Noise Canceler - CLEAR */
#define TC1_FPNC1_SET_gc   (0x20) /* Fault Protection Noise Canceler - SET */


/* Fault Protection Edge Select */
#define TC1_FPES1_CLEAR_gc (0x00) /* Fault Protection Edge Select - CLEAR */
#define TC1_FPES1_SET_gc   (0x10) /* Fault Protection Edge Select - SET */


/* Fault Protection Analog Comparator Enable */
#define TC1_FPAC1_CLEAR_gc (0x00) /* Fault Protection Analog Comparator Enable - CLEAR */
#define TC1_FPAC1_SET_gc   (0x08) /* Fault Protection Analog Comparator Enable - SET */


/* Fault Protection Interrupt Flag */
#define TC1_FPF1_CLEAR_gc (0x00) /* Fault Protection Interrupt Flag - CLEAR */
#define TC1_FPF1_SET_gc   (0x04) /* Fault Protection Interrupt Flag - SET */


/* Waveform Generation Mode Bit */
#define TC1_WGM1_VAL_0x00_gc (0x00) /* Fast PWM (NB! PWMx must be set!) */
#define TC1_WGM1_VAL_0x01_gc (0x01) /* Phase and Frequency Correct PWM */
#define TC1_WGM1_VAL_0x02_gc (0x02) /* PWM6/Single-slope */
#define TC1_WGM1_VAL_0x03_gc (0x03) /* PWM6/Dual-slope */


/* OCIE1D: Timer/Counter1 Output Compare Interrupt Enable */
#define TC1_OCIE1D_CLEAR_gc (0x00) /* OCIE1D: Timer/Counter1 Output Compare Interrupt Enable - CLEAR */
#define TC1_OCIE1D_SET_gc   (0x80) /* OCIE1D: Timer/Counter1 Output Compare Interrupt Enable - SET */


/* OCIE1A: Timer/Counter1 Output Compare Interrupt Enable */
#define TC1_OCIE1A_CLEAR_gc (0x00) /* OCIE1A: Timer/Counter1 Output Compare Interrupt Enable - CLEAR */
#define TC1_OCIE1A_SET_gc   (0x40) /* OCIE1A: Timer/Counter1 Output Compare Interrupt Enable - SET */


/* OCIE1A: Timer/Counter1 Output Compare B Interrupt Enable */
#define TC1_OCIE1B_CLEAR_gc (0x00) /* OCIE1A: Timer/Counter1 Output Compare B Interrupt Enable - CLEAR */
#define TC1_OCIE1B_SET_gc   (0x20) /* OCIE1A: Timer/Counter1 Output Compare B Interrupt Enable - SET */


/* Timer/Counter1 Overflow Interrupt Enable */
#define TC1_TOIE1_CLEAR_gc (0x00) /* Timer/Counter1 Overflow Interrupt Enable - CLEAR */
#define TC1_TOIE1_SET_gc   (0x04) /* Timer/Counter1 Overflow Interrupt Enable - SET */


/* Timer/Counter1 Output Compare Flag 1D */
#define TC1_OCF1D_CLEAR_gc (0x00) /* Timer/Counter1 Output Compare Flag 1D - CLEAR */
#define TC1_OCF1D_SET_gc   (0x80) /* Timer/Counter1 Output Compare Flag 1D - SET */


/* Timer/Counter1 Output Compare Flag 1A */
#define TC1_OCF1A_CLEAR_gc (0x00) /* Timer/Counter1 Output Compare Flag 1A - CLEAR */
#define TC1_OCF1A_SET_gc   (0x40) /* Timer/Counter1 Output Compare Flag 1A - SET */


/* Timer/Counter1 Output Compare Flag 1B */
#define TC1_OCF1B_CLEAR_gc (0x00) /* Timer/Counter1 Output Compare Flag 1B - CLEAR */
#define TC1_OCF1B_SET_gc   (0x20) /* Timer/Counter1 Output Compare Flag 1B - SET */


/* Timer/Counter1 Overflow Flag */
#define TC1_TOV1_CLEAR_gc (0x00) /* Timer/Counter1 Overflow Flag - CLEAR */
#define TC1_TOV1_SET_gc   (0x04) /* Timer/Counter1 Overflow Flag - SET */


/* Timer/Counter 1 Dead Time Value-DT1H */
#define TC1_DT1_DT1H_gc(x) ((x<<4) & 0xF0)

/* Timer/Counter 1 Dead Time Value-DT1L */
#define TC1_DT1_DT1L_gc(x) (x & 0x0F)

/*
--------------------------------------------------------------------------------
BOOT_LOAD - Bootloader
--------------------------------------------------------------------------------
*/


/* Clear temporary page buffer */
#define BOOT_LOAD_CTPB_CLEAR_gc (0x00) /* Clear temporary page buffer - CLEAR */
#define BOOT_LOAD_CTPB_SET_gc   (0x10) /* Clear temporary page buffer - SET */


/* Read fuse and lock bits */
#define BOOT_LOAD_RFLB_CLEAR_gc (0x00) /* Read fuse and lock bits - CLEAR */
#define BOOT_LOAD_RFLB_SET_gc   (0x08) /* Read fuse and lock bits - SET */


/* Page Write */
#define BOOT_LOAD_PGWRT_CLEAR_gc (0x00) /* Page Write - CLEAR */
#define BOOT_LOAD_PGWRT_SET_gc   (0x04) /* Page Write - SET */


/* Page Erase */
#define BOOT_LOAD_PGERS_CLEAR_gc (0x00) /* Page Erase - CLEAR */
#define BOOT_LOAD_PGERS_SET_gc   (0x02) /* Page Erase - SET */


/* Store Program Memory Enable */
#define BOOT_LOAD_SPMEN_CLEAR_gc (0x00) /* Store Program Memory Enable - CLEAR */
#define BOOT_LOAD_SPMEN_SET_gc   (0x01) /* Store Program Memory Enable - SET */


/*
--------------------------------------------------------------------------------
EXINT - External Interrupts
--------------------------------------------------------------------------------
*/


/* Interrupt Sense Control 0 Bit 1 */
#define EXINT_ISC01_CLEAR_gc (0x00) /* Interrupt Sense Control 0 Bit 1 - CLEAR */
#define EXINT_ISC01_SET_gc   (0x02) /* Interrupt Sense Control 0 Bit 1 - SET */


/* Interrupt Sense Control 0 Bit 0 */
#define EXINT_ISC00_VAL_0x00_gc (0x00) /* Low Level of INTX */
#define EXINT_ISC00_VAL_0x01_gc (0x01) /* Any Logical Change of INTX */
#define EXINT_ISC00_VAL_0x02_gc (0x02) /* Falling Edge of INTX */
#define EXINT_ISC00_VAL_0x03_gc (0x03) /* Rising Edge of INTX */


/* External Interrupt Request 1 Enable */
#define EXINT_GIMSK_INT_gc(x) ((x<<6) & 0xC0)

/* Pin Change Interrupt Enables */
#define EXINT_GIMSK_PCIE_gc(x) ((x<<4) & 0x30)

/* External Interrupt Flags */
#define EXINT_GIFR_INTF_gc(x) ((x<<6) & 0xC0)

/* Pin Change Interrupt Flag */
#define EXINT_PCIF_CLEAR_gc (0x00) /* Pin Change Interrupt Flag - CLEAR */
#define EXINT_PCIF_SET_gc   (0x20) /* Pin Change Interrupt Flag - SET */


